Repository/AuthUserRepository.php

    public function if_password($email, $password)
    {
        $user = Users::findOne(['email' => $email]);
---
SELECT * FROM "users" WHERE "email"='vuacheslav.mir@gmail.com'

    public function auth($context)
    {
        $user = Users::findOne(['email' => $context->email]);
        // Ренерация Access Token
        $token = (string)$this->createBearerToken($user->id);
        $get_access_token = AccessKey::findOne(['user_id' => $user->id]);

        if ($get_access_token)
        {
            $db = AccessKey::findOne(['user_id' => $user->id]);
            $db->token = $token;
            $db->created_at = date('Y/m/d h:i:s', time());
            // Валидация параметров
            if ($db->validate())
            {
                $db->save();
---
SELECT EXISTS(SELECT * FROM "users" WHERE "users"."id"=1)
SELECT * FROM "users" WHERE "email"='vuacheslav.mir@gmail.com'
SELECT * FROM "access_key" WHERE "user_id"=1
UPDATE "access_key" SET "token"='eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MSwiZXhwIjoxNjcyNzIzNzkwLCJpc3MiOiIxMjcuMC4wLjEiLCJpYXQiOjE2NzI3MjM3NDB9.xAPFnIQIezcsEPrXXDIYH8qqXdvFbtUiGnwFHHec_jg', "created_at"='2023/01/03 05:29:00' WHERE "id"=1