Repository/LessonListRepository.php

SELECT * FROM "lessons" WHERE "organization_id"=1
---
    public function lessonByOrganizationId(\app\DTO\LessonListDTO $context)
    {
        $db = Lessons::findAll(['organization_id' => $context->organization_id]);