Repository/LessonCreateRepository.php

    public function create(\app\DTO\LessonCreateDTO $context)
    {
        $db = new Lessons();
        $db->organization_id = $context->organization_id;
        $db->filial_id = $context->filial_id;
        $db->teacher_id = $context->teacher_id;
        $db->name = $context->name;
        // Валидация параметров
        if ($db->validate())
        {
            $db->save();
---
INSERT INTO "lessons" ("organization_id", "filial_id", "teacher_id", "name") VALUES (1, NULL, NULL, 'Русский язык') RETURNING "id"