Repository/LessonDeleteRepository.php

    public function delete(\app\DTO\LessonDeleteDTO $context)
    {
        $db = Lessons::findOne(['id' => $context->id]);
        $db->delete();
---
SELECT * FROM "lessons" WHERE "id"=4
DELETE FROM "lessons" WHERE "id"=4