Repository/SettingsInfoRepository.php

SELECT * FROM "settings" WHERE "id"=1
---
    public function show(\app\DTO\SettingsInfoDTO $context)
    {
        $db = Settings::findOne(['id' => $context->organization_id]);