Repository/UserShowOneRepository.php

    public function show(\app\DTO\UserShowOneDTO $context)
    {
        $db = Users::findOne([
            'organization_id' => $context->organization_id,
            'id' => $context->user_id,
            'role' => $context->role
        ]);
---
SELECT * FROM "users" WHERE ("organization_id"=1) AND ("id"='18') AND ("role"='Преподаватель')