Repository/UserInfoRepository.php

SELECT * FROM "access_key" WHERE "token"='eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6MiwiZXhwIjoxNjcxOTg2NTExLCJpc3MiOiIxMjcuMC4wLjEiLCJpYXQiOjE2NzE5ODY0NjF9.YpZHyOaBbqRMuTkN3bYGETdCHDRpsp74CgLbGgYsybo'
SELECT * FROM "users" WHERE "id"=2
SELECT * FROM "organization" WHERE "id"=1
---
    public function show($context)
    {
        $identified = AccessKey::findOne(['token' => $context->token]);
        $is_user = Users::findOne(['id' => $identified->user_id]);
        array_push($this->user, $is_user);
        $is_organization = Organization::findOne(['id' => $is_user->organization_id]);